In [3]:
import pandas as pd
import numpy as np

In [11]:
data = {
    "col1": [10,np.nan,30,40,50],
    "col2": [400,450,np.nan, 600,650],
    "col3": ["A", "A", "B", np.nan, "C"]
}

df = pd.DataFrame(data)
df

   col1   col2 col3
0  10.0  400.0    A
1   NaN  450.0    A
2  30.0    NaN    B
3  40.0  600.0  NaN
4  50.0  650.0    C

In [15]:
df = df.interpolate(method = "linear")
df

   col1   col2 col3
0  10.0  400.0    A
1  20.0  450.0    A
2  30.0  525.0    B
3  40.0  600.0  NaN
4  50.0  650.0    C

In [18]:
df = df.interpolate(method = "pad")
df

   col1   col2 col3
0  10.0  400.0    A
1  20.0  450.0    A
2  30.0  525.0    B
3  40.0  600.0    B
4  50.0  650.0    C